In [1]:
import pandas as pd

In [9]:
df.describe

<bound method NDFrame.describe of    Unnamed: 0  train nos  speed       citys
0           0         11     50  bhubanewar
1           1         22     34     kolkata
2           2         33     24      ranpur
3           3         44     17         NYC>

In [3]:
pd.__version__

'2.0.3'

In [4]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [11]:
df = pd.read_csv("salaries.csv")  #  comma-separated values 
df.shape

(78, 6)

In [12]:
df.describe

<bound method NDFrame.describe of          rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]>

In [14]:
df.describe()

             phd    service         salary
count  76.000000  78.000000      76.000000
mean   19.605263  15.051282  108003.355263
std    12.508215  12.139768   28525.350088
min     1.000000   0.000000   57800.000000
25%    10.000000   5.250000   87250.000000
50%    18.500000  14.500000  104671.000000
75%    27.250000  20.750000  127077.750000
max    56.000000  51.000000  186960.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         76 non-null     float64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      76 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [16]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [23]:
df.columns.to_list()

['rank', 'discipline', 'phd', 'service', 'sex', 'salary']

In [24]:
df.size  #

468

In [25]:
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [26]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [27]:
df.tail()

         rank discipline   phd  service     sex    salary
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [28]:
df.head(3)

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0

In [29]:
df.tail(2)

    rank discipline   phd  service     sex    salary
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0

In [31]:
df.sample()

    rank discipline   phd  service   sex    salary
10  Prof          B  39.0       33  Male  128250.0

In [32]:
df.sample(2)

        rank discipline  phd  service     sex   salary
57  AsstProf          A  3.0        1  Female  72500.0
12  AsstProf          B  1.0        0    Male  88000.0

In [34]:
print(df.to_string())

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
5        Prof          A  20.0       20    Male  122400.0
6   AssocProf          A  20.0       17    Male   81285.0
7        Prof          A  18.0       18    Male       NaN
8        Prof          A  29.0       19    Male   94350.0
9        Prof          A  51.0       51    Male   57800.0
10       Prof          B  39.0       33    Male  128250.0
11       Prof          B  23.0       23    Male  134778.0
12   AsstProf          B   1.0        0    Male   88000.0
13       Prof          B   NaN       33    Male  162200.0
14       Prof          B  25.0       19    Male  153750.0
15       Prof          B  17.0        3    Male  150480.0
16   AsstProf          B   8.0        3    Male   75044.0
17   AsstProf          B   4.0        0    Male   92000.0
18       Prof          A  19.0        7    Male  107300.0
19       Prof          A  29.0       27    Male  150500.0
20   AsstProf          B   4.0        4    Male   92000.0
21       Prof          A  33.0       30    Male  103106.0
22   AsstProf          A   4.0        2    Male   73000.0
23   AsstProf          A   2.0        0    Male   85000.0
24       Prof          A  30.0       23    Male   91100.0
25       Prof          B  35.0       31    Male   99418.0
26       Prof          A  38.0       19    Male  148750.0
27       Prof          A  45.0       43    Male  155865.0
28   AsstProf          B   7.0        2    Male       NaN
29       Prof          B  21.0       20    Male  123683.0
30  AssocProf          B   9.0        7    Male  107008.0
31       Prof          B  22.0       21    Male  155750.0
32       Prof          A  27.0       19    Male  103275.0
33       Prof          B  18.0       18    Male  120000.0
34  AssocProf          B   NaN        8    Male  119800.0
35       Prof          B  28.0       23    Male  126933.0
36       Prof          B  45.0       45    Male  146856.0
37       Prof          A  20.0        8    Male  102000.0
38   AsstProf          B   4.0        3    Male   91000.0
39       Prof          B  18.0       18  Female  129000.0
40       Prof          A  39.0       36  Female  137000.0
41  AssocProf          A  13.0        8  Female   74830.0
42   AsstProf          B   4.0        2  Female   80225.0
43   AsstProf          B   5.0        0  Female   77000.0
44       Prof          B  23.0       19  Female  151768.0
45       Prof          B  25.0       25  Female  140096.0
46   AsstProf          B  11.0        3  Female   74692.0
47  AssocProf          B  11.0       11  Female  103613.0
48       Prof          B  17.0       17  Female  111512.0
49       Prof          B  17.0       18  Female  122960.0
50   AsstProf          B  10.0        5  Female   97032.0
51       Prof          B  20.0       14  Female  127512.0
52       Prof          A  12.0        0  Female  105000.0
53   AsstProf          A   5.0        3  Female   73500.0
54  AssocProf          A  25.0       22  Female   62884.0
55   AsstProf          A   2.0        0  Female   72500.0
56  AssocProf          A  10.0        8  Female   77500.0
57   AsstProf          A   3.0        1  Female   72500.0
58       Prof          B  36.0       26  Female  144651.0
59  AssocProf          B  12.0       10  Female  103994.0
60   AsstProf          B   3.0        3  Female   92000.0
61  AssocProf          B  13.0       10  Female  103750.0
62  AssocProf          B  14.0        7  Female  109650.0
63       Prof          A  29.0       27  Female   91000.0
64  AssocProf          A  26.0       24  Female   73300.0
65       Prof          A  36.0       19  Female  117555.0
66   AsstProf          A   7.0        6  Female   63100.0
67       Prof          A  17.0       11  Female   90450.0
68   AsstProf          A   4.0        2  Female   77500.0
69       Prof          A  28.0        7  Female  116450.0
70   AsstProf          A   8.0        3  Female   78500.0
71  AssocProf          B  12.0        9  Female   71065.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [35]:
df['discipline']

0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object

In [36]:
df['discipline'].unique()

array(['B', 'A'], dtype=object)

In [38]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [39]:
df['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [40]:
df['rank'].value_counts()

rank
Prof         46
AsstProf     19
AssocProf    13
Name: count, dtype: int64

In [41]:
df['discipline'].value_counts()

discipline
B    42
A    36
Name: count, dtype: int64

In [42]:
df['sex'].value_counts()

sex
Male      39
Female    39
Name: count, dtype: int64

In [44]:
df['salary'].min()

57800.0

In [45]:
df['salary'].max()

186960.0

In [46]:
df['salary'].mean()

108003.3552631579

In [48]:
df[['salary','phd']]

      salary   phd
0   186960.0  56.0
1    93000.0  12.0
2   110515.0  23.0
3   131205.0  40.0
4   104800.0  20.0
..       ...   ...
73  105450.0  18.0
74  104542.0  19.0
75  124312.0  17.0
76  109954.0  28.0
77  109646.0  23.0

[78 rows x 2 columns]

In [49]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
df[['rank','salary']]

In [54]:
average_salary = df['salary'].mean()

above_average_salaries = df[df['salary'] > average_salary]
above_average_salaries

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
5        Prof          A  20.0       20    Male  122400.0
10       Prof          B  39.0       33    Male  128250.0
11       Prof          B  23.0       23    Male  134778.0
13       Prof          B   NaN       33    Male  162200.0
14       Prof          B  25.0       19    Male  153750.0
15       Prof          B  17.0        3    Male  150480.0
19       Prof          A  29.0       27    Male  150500.0
26       Prof          A  38.0       19    Male  148750.0
27       Prof          A  45.0       43    Male  155865.0
29       Prof          B  21.0       20    Male  123683.0
31       Prof          B  22.0       21    Male  155750.0
33       Prof          B  18.0       18    Male  120000.0
34  AssocProf          B   NaN        8    Male  119800.0
35       Prof          B  28.0       23    Male  126933.0
36       Prof          B  45.0       45    Male  146856.0
39       Prof          B  18.0       18  Female  129000.0
40       Prof          A  39.0       36  Female  137000.0
44       Prof          B  23.0       19  Female  151768.0
45       Prof          B  25.0       25  Female  140096.0
48       Prof          B  17.0       17  Female  111512.0
49       Prof          B  17.0       18  Female  122960.0
51       Prof          B  20.0       14  Female  127512.0
58       Prof          B  36.0       26  Female  144651.0
62  AssocProf          B  14.0        7  Female  109650.0
65       Prof          A  36.0       19  Female  117555.0
69       Prof          A  28.0        7  Female  116450.0
72       Prof          B  24.0       15  Female  161101.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [55]:
stud = {
    'sem':[1,2,3,4,5],
    'sub':['c','ds','oops','java','python']
}

In [56]:
type(stud)

dict

In [58]:
data= pd.DataFrame(stud)

In [59]:
type(data)

pandas.core.frame.DataFrame

In [60]:
data

   sem     sub
0    1       c
1    2      ds
2    3    oops
3    4    java
4    5  python

In [62]:
week = ['mon','tue','wed','thur','fri']
# pd.Series(week)
# pd.Series(['mon','tue','wed','thur','fri'])

In [63]:
pd.Series(week)

0     mon
1     tue
2     wed
3    thur
4     fri
dtype: object

In [64]:
pd.Series(['mon','tue','wed','thur','fri'])

0     mon
1     tue
2     wed
3    thur
4     fri
dtype: object

In [65]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        2
dtype: int64

In [66]:
df[df.isnull().any(axis=1)]

         rank discipline   phd  service   sex    salary
7        Prof          A  18.0       18  Male       NaN
13       Prof          B   NaN       33  Male  162200.0
28   AsstProf          B   7.0        2  Male       NaN
34  AssocProf          B   NaN        8  Male  119800.0

In [68]:
dm = df['phd'].mean()

In [69]:
df['phd'].fillna(dm)

0     56.0
1     12.0
2     23.0
3     40.0
4     20.0
      ...
73    18.0
74    19.0
75    17.0
76    28.0
77    23.0
Name: phd, Length: 78, dtype: float64

In [70]:
df[df.isnull().any(axis=1)]

         rank discipline   phd  service   sex    salary
7        Prof          A  18.0       18  Male       NaN
13       Prof          B   NaN       33  Male  162200.0
28   AsstProf          B   7.0        2  Male       NaN
34  AssocProf          B   NaN        8  Male  119800.0

In [71]:
df['salary'].fillna(df['salary'].mean(), inplace=True)
df['phd'].fillna(df['phd'].mean(), inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [72]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [85]:
hsm = df[df['sex']=='Male']
hsm['salary'].max()
hsm[hsm['salary'] == hsm['salary'].max()]

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0

In [84]:
hsf = df[df['sex']=='Female']
# hsf['salary'].max()
hsf[hsf['salary'] == hsf['salary'].max()]

    rank discipline   phd  service     sex    salary
72  Prof          B  24.0       15  Female  161101.0

In [83]:
hsf[hsf['salary'] == hsf['salary'].max()]

    rank discipline   phd  service     sex    salary
72  Prof          B  24.0       15  Female  161101.0

In [78]:
lsf = df[df['sex']=='Male']
lsf['salary'].min()
lsf[lsf['salary'] == lsf['salary'].min()]

57800.0

In [79]:
lsm = df[df['sex']=='Female']
lsm['salary'].min()
lsm[lsm['salary'] == lsm['salary'].min()]

62884.0

In [87]:
print(hsf[hsf['salary'] == hsf['salary'].max()])
print(hsm[hsm['salary'] == hsm['salary'].max()])
print(lsf[lsf['salary'] == lsf['salary'].min()])
print(lsm[lsm['salary'] == lsm['salary'].min()])

    rank discipline   phd  service     sex    salary
72  Prof          B  24.0       15  Female  161101.0
   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
   rank discipline   phd  service   sex   salary
9  Prof          A  51.0       51  Male  57800.0
         rank discipline   phd  service     sex   salary
54  AssocProf          A  25.0       22  Female  62884.0

In [97]:
p = df[df['rank'] == 'Prof']
print(p[p['salary'] == p['salary'].max()])
print(p[p['salary'] == p['salary'].min()])

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
   rank discipline   phd  service   sex   salary
9  Prof          A  51.0       51  Male  57800.0

In [98]:
p = df[df['rank'] == 'AssocProf']
print(p[p['salary'] == p['salary'].max()])
print(p[p['salary'] == p['salary'].min()])

         rank discipline        phd  service   sex    salary
34  AssocProf          B  19.605263        8  Male  119800.0
         rank discipline   phd  service     sex   salary
54  AssocProf          A  25.0       22  Female  62884.0

In [99]:
# Replace missing 'Salary' values with the mean of matching salaries for those with the same 'service'
df['salary'] = df['salary'].fillna(df.groupby('service')['salary'].transform('mean'))

# Verify the changes
missing_salaries_replaced = df[df['salary'].isnull()]
missing_salaries_replaced

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [100]:
# Replace missing 'phd' values with the mean of matching 'service'
df['phd'] = df['phd'].fillna(df.groupby('service')['phd'].transform('mean'))

# Verify the changes
missing_phd_replaced = df[df['phd'].isnull()]
missing_phd_replaced

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []